label prologue:
    scene forest with dissolve
    father "Сьюзан, он слева!"
    show susan portrait at left with dissolve
    #1111111111 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 2222222222 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 3333333333 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 4444444444 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789
    "Привычно сжав ногами теплую спину коня, мыщцы котрого натянулись от скорости и азарта погони, я вскинула небольшой охотничий арбалет на изготовку и стала ловить момент для выстрела. Дерево. Еще одно. Еще ближе. Опять дерево. Бревно."
    susan "АГА! Попался!"
    show deer at right with dissolve
    "Арбалетный болт со свистом пролетел между деревьев и утонул в зеленом море летней лесной травы, а олень, будто смеясь, вильнул мимо меня и помчался вперед нас."
    hide deer with dissolve
    susan "'Черт!' - вырвалось у меня и я, обвив вокруг руки ремень узды коня, принялась перезаряжать арбалет."
    hide susan with dissolve
    show father at right with dissolve
    father "Хаха, что ж, настала моя очередь! Вперед!"
    "Весело прокричал второй всадник, накладывая стрелу на тетиву огромного лука и мчась вперед по лесной тропе. И вот, спустя секунд 10 раздалось победное"
    father "Есть!"
    hide father with dissolve
    "И олень с пронзительным визгом упал и покатился в траву."
    show susan with dissolve
    susan "Ну пап, опять ты выиграл!"
    hide susan with dissolve
    "Я взглянула на своего отца, который уже закинул лук назад и уверенно держался в седле, провожая взглядом поверженного метким выстрелом оленя. Он тоже посмотрел на меня, но я не успела ничего прочитать в его взгляде."
    show father with dissolve
    father "Сьюзан, берегись!"
    hide father with dissolve
    "Я посмотрела на дорогу и в последний момент успела пригнуться от нависшей ветки, однако потеряла равновесие и на большой скорости начала падать вниз... У земли меня встретила не боль и агония от переломов, а мягкий магический поток, созданный отцом, загасивший большую часть моего падения, но не остановивший его полностью."
    "С шумом я упала на дорогу и скатилась в лесные заросли. После моих бешеных кувырков я прислонилась к ближайшему дереву. Через секунду мой отец спрыгнул с коня и присел рядом со мной."
    show father with dissolve
    father "'Ты в порядке?'"
    hide father with dissolve
    show susan with dissolve
    susan "'Жить буду...' - пролепетала я, переводя дыхание. Тут я поняла, что не зря отбивала спину на тренировках по боевой акробатике. Ну и повезло, что я скатилась в кусты, а не в овраг. Успокаювающий голос вырвал меня из хаотичных размышений о моем маленьком приключении."
    hide susan with dissolve
    show father with dissolve
    father "'Ну хорошо.'"
    "Папа улыбнулся своей заботливой улыбкой. Затем он пошел за поверженным оленем. Пробивающиеся через густую листву лучи солнца мягко и приятно освяжели дорогу и выделяли слуэт моего спасителя. "
    "Вот он, во плоти, мой отец- подтянутый, красивый человек с серебристыми волосами и едва заметным шрамом у глаза, с невероятно уверенными и в тоже время заботливыми глазами, в зрелом возрасте, однако готовый посостязаться в ловкости и силе с любым человеком."
    hide father with dissolve
    "Эдвард Глостер- потомственный дворянин, военный, успешный торговец, крупнейший землевладелец с безупречной репутацией человека, умеющего вести дела. Странно, что сейчас я его описываю именно так, ведь во время охоты мы забываем все титулы и цены украшений и оружия, что носим при себе, и начинаем состязание в меткости стрельбы и верховой езде."
    "Охватываемый чувством азарта, ты начинаешь ловить каждый момент, каждое шевеление листвы, каждый шаг, каждый удар биения сердца, словно с твоим напарником оно бьется в едином ритме. В такие моменты рядом со мной не Эдвард Глостер, а родной и любимый папа, мой наставник и друг, который всегда находил для меня время за все те 19 лет, что он был рядом."
    "А еще он чертовски хороший охотник, и хоть, я рада, что мы наконец догнали этого проворного оленя, мне немного обидно, что я так и не попала в него. Эх, как же это раслабляет от нашей дворянской рутины. Я подозвала своего коня и стала отряхивать со своей одежды куски земли и листву."
    "Да, не подобает аристократке Сьюзан Глостер так выглядеть. Комья грязи в волосах, остатки уже чуть подсохшей лесной земли на одежде, пару безобидных, но некрасивых ссадин. Но это ничего, боюсь представить, что было бы без магической поддержки моего отца. К моменту, когда я как могла разобралась с последствиями падения, отец с тушей оленя подошел ко мне."
    show father with dissolve
    father "'Ну что, меткий стрелок, нам пора возвращаться в замок.'"
    hide father with dissolve
    "Я кивнула, и мы, оседлав коней, направились к нашему замку, вместе проходя родные кроны деревьев, цветы, ягоды, цветы и вдыхая каждый приветливый лесной мимолетный и радостный летний запах, вкушая все моменты нашей прекрасной жизни. Мы шли по знакомой тропе. Слышался спокойный стук копыт и тихое пение птиц на деревьях."
    show susan at left with dissolve
    susan "'Кстати, ты проиграл. Хихи. Мы же договорились не использовать магию на охоте.'"
    show father at right with dissolve
    father "'А еще у нас завтра встреча с бароном Маппой, где ты должна быть.'"
    susan "'Весьма эгоистичная причина.'"
    father "'А теперь вспомни, с чего ты начала разговор.' - отец улыбнулся."
    susan "Слушай, а как работает магия?"
    "В быту я видела мало магии, учиться ей я не хотела (но понимала, что когда-нибудь это придется сделать). Магией колдовали боевые заклинания, поднимали магические щиты на полях боя, разжигали огонь, охлаждали и нагревали воздух и делали много чего еще, но как она работала, я толком не знаю."
    father "'Очень просто. Магия- это преобразование твоей энергии. А во что именно ее превращать- в огненный шар, барьер или мягкий поток решать тебе.'"
    susan "'А исцелять ей можно?'"
    father "'В теории это возможно. Но на практике этого никому не удавалось. Видишь ли, всякие огненные шары, ледяные стены, магические барьеры состоят из одного вида материи, куда ты и направляешь свою энергию, а живая плоть невероятно сложная в создании...'"
    father "Внезапно папа притих - 'Конечно, я пробовал, но безуспешно.' Его мимолетная скорбь исчезла и он снова вернулся в прежнее расположение духа."
    father "'Честно говоря, Сьюзен, я мало чего знаю о магии. Возможно, тебе нужно поговорить с моим хорошим знакомым магом Эльмиром. Он научился колдовать еще в раннем возрасте, может, он начнет твое обучение и ответит на твои вопросы. Глядя на него, даже не веришь, что магия так многогранна.'"
    susan "'Ты правда думаешь, что мне нужно учиться магии? Это же нереально истощает и выматывает!'- я по-детски обиделась и сморщила нос."
    father "'Конечно, маленькой Сьюзи не нужно корпеть над магическими писменами, а вот аристократке Сьюзен Глостер необходима базовая магическая подготовка, чтобы защитить себя. Да и на охоте это выручает, как видишь.'"
    susan "'Я и так смогу за себя постоять. У меня есть для этого все необходимые навыки.'"
    "Я коснулась рукояти небольшой булавы и глянула на перевязь с метательными ножами."
    father "'Я не всегда буду рядом. Конечно, тебе, как девушке из знатного рода, не придется сражаться в войнах, но у нас много врагов. Мы должны защитить свою семью и друзей. Так что начни изучать магию, лишним не будет.'"
    susan "'Хорошо, папа. Я займусь этим в ближайшее время.'"
    father "'Ну и умница.' - он вновь наградил меня своей безупречной улыбкой - 'Скоро наши владения, начинай вести себя прилично, хахаха.'"
    susan "'Сударь, я откажусь от комментариев.'"
    "Лес становился все реже, заросли сменялись опушками, а многолетние деревья- молоденькими стволами."
    father "'Ну вот мы и дома.'"
    hide father with dissolve
    hide susan with dissolve
    scene fields with dissolve
    "Мы вышли из леса на небольшой холм, откуда были видны наши родные земли. Сначала зеленой полосой распологались поля, за ними чернели плодородные почвы, где росли овощи и травы, а потом их сменяли сады с аккуратно ухоженными дорожками. Левее полей сверкающей змеей текла река, у ее берегов виднелись мельницы и скромные дома рабов. А в центре был наш замок."
    "Небольшой, но древний. Могучие стены с рвом, обитые металлом ворота, красная черепица впитывала солнечный свет, а на самой высокой башне гордо развивался флаг Глостеров. Большая пыльная торговая дорога шла от замка вдаль к городу, по который шли обозы с товарами. А справа от замка вдалеке виднелись величественные горы."
    "Передо мной раскинулись все владения моего славного и великого рода. И я буду хранить эти земли во имя Глостеров."
    "Насладившись этим прекрасными видом, мы с отцом направились к замку."
    "Напрямую дорогу от лесного холма к замку не было. Так что приходится обезжать все поля и сады левее - там, где стоят водяные мельницы и домики рабов. Мы вышли на небольшую дорогу, полную слебов от копыт и колес телег, нагруженными зерном и мукой. Все, кто встречал нас, кланялся и уступал дорогу, отец же почтительно кивал в ответ."
    scene watermill with dissolve
    
    "Я тоже старалась так делать, но получалось у меня слишком уж резко, безэмоционально и дергано, сказывается недостаток опыта. В этих местах мельниц было всего две, но зато какие это были мельницы. Первая - огромный каменный водяной монстр с гигантским колесом размером с крепостную стену, будто укращала течение могучей реки, а не повторяло ее ритм."
    "В стенах этой мельницы уже не одно поколение перемалывало зерно, а птицы уже привыкли за много лет гнездиться под крышей, а она стояла еще когда я не родилась. Эта постройка была чуть ли не самой старой в нашем округе, не считая, разве что, замка."
    "В двух километрах ниже по течению реки виднелась вторая мельница. Она была чуть поменьше, из деревянного сруба и будто утопала в самой реке. Ее внешний вид понятен, ведь ее колесо находилось снизу постройки и вращалось в горизонтальной плоскости (да, уроки математики от учителя Персифаля не прошли даром). Так и стояла- скромная и малоэффективная."
    "Но один умник заплатил моему отцу кругленькую сумму в очень хороший момент, за его разрешение построить эту мельницу. Вот она и работает, принося небольшой процент - этому грамотею, а еще больший - моему отцу. Пусть эта мельница и была небольшой, но она имела свой малый стиль: простые, но красивые резные фигуры из дерева часто встречались в ее корпусе."
    "Минуя невзрачные, но чистые, домики рабов и мельницы, мы вышли на небольшой торговый перекресток. Если пойти левее, то дорога пересекалась с большой торговой дорогой, ведущей в город, а если свернуть правее, то дорога становилась уже и вела к нашему замку."
    "У дороги к нашему замку располагались разнообразные заросли, а при приближении к замку, они сменялись на старинный лиственный лес. Хотя главная торговая площадь находится в городе, в сторону замка тоже напрявляются торговые обозы. Многие товары нужны для стабильной работы структуры замка и его окружения или для личных сделок отца."
    scene forest with dissolve
    "Мы свернули направо и направились к замку. Впереди нас мирно ехала торговая телега, накрытая цветной тканью. Впереди сидели двое. Один держал за поводья лошадь, скорее всего, торговец, а рядом сидел человек в сером мешковатом одеянии, может, второй торговец или просто попутчик. Проехав еще немного, отец, вдруг, стал крутить головой по сторонам и вглядываться в заросли."
    show father with dissolve
    father "'Что-то не так...'- хмуро сказал он, глядя вперед повозки."
    hide father with dissolve
    "Внезапно из кустов выскочило семеро вооруженных людей. Трое из них стали хватать за поводья лошадь, останавливая повозку, двое с копьями полезли к телеге, а еще двое остались в зарослях и вскинули легкие луки."
    show father with dissolve
    father "'Засада! Держись позади меня, Сьюзан!'- крикнул отец, обнажая свой меч, спрыгивая с коня и напрявляясь прямо на врагов."
    hide father with dissolve
    "Я соскочила с коня, сняла с седла небольшой деревянный щит, достала булаву и побежала за отцом."
    "Торговец" "'Сучьи разбойники! Уходим за телегу!' - донеслось из телеги."
    "Разбойники" "'Хехехе, попробуй от нас убежать, паскуда!' - хрипло выкрикнул кто-то из нападавших."
    "Торговец с его спутником в капюшоне выскочили из телеги. Первый достал из под ткани топор, а другой человек остался позади и стал читать заклинание. Так он маг?"
    menu:
        "Вдруг я услышала еле уловимый свист слева, который приближался ко мне. Я повернула голову и тут до меня дошло..."
        "Уклонилась":
            "Отработанным на тренировках движением я вскинула щит и словила стрелу. Ну попробуйте, мрази!"
            show susan with vpunch
            susan "'Я за лучниками!'- крикнула я отцу и зигзагами, уворачиваясь от стрел, побежала к этим уродам в кусты, а они только и думали натягивать свои луки, да стрелять в меня."
            hide susan with dissolve
            "Когда я была уже совсем рядом, один из них откинул лук, достал большой уродливый нож и прыгнул навстречу мне."
            "Разбойник" "Ну давай, сейчас мы тебе подправим мордашку."
        "Не уклонилась":
            "АЙ! Стрела вонзилась мне в плечо, немного пробив кожанный наплечник. Плечо загорелось огнем."
            show susan with vpunch
            susan "'АААААА, МРАЗИ! Я за лучникам!'-крикнула я отцу. Ну держитесь, суки, я вам сейчас такое устрою. Я зверски кинулась на врагов, попутно уворачиваясь от стрел."
            hide susan with dissolve
            "Когда я была уже совсем рядом, один из них откинул лук, достал большой уродливый нож и прыгнул навстречу мне. Ну все, пора тебе раздробить пару-тройку костей."
    jump first_fight
    label first_fight_end:
    if first_fight_flag:
        # Победа в первом сражении
        "Наконец моя булава достигла цели, послышался хруст сломанных ребер, бандит согнулся, а я врезала ему по голове. Он скатился в канаву с пробитым черепом. Я глянула на второго лучника, уже натягивавшего тетиву лука и целящегося в меня. Я вскинула щит и готова была бросится на него, но тут к нему с необычайной для своих лет прытью приблизился отец."
        "Один взмах его меча, фонтан кровяных брызг и разбойник падает на землю с рассеченной грудью, так и не успев вскинуть оружие для защиты."
        show father at right with dissolve
        show susan at left with dissolve
        father "'Ты в норме?'-отец быстро глянул на меня."
        susan "Да!"
        hide father with dissolve
        "Отец коротко кивнул и ринулся к телеге, где сражались торговец и маг с остатками шайки."
        "Я оббежала телегу и увидела, как торговец неуклюжо отскочил от удара копья, а затем прыгнул сбоку и пробил топором спину бандиту. С криком он повалился на землю, подняв тучу пыли. Не мешкая, торговец пробил ему говолу обухом"
        show mage at right with dissolve
        "Те трое людей, что останавливали лощадь, кинулись с копьями и ножами на защитников торговой телеги, но тут маг быстро прочитал заклинание и огромный огненный шар сорвался с его рук, перелетел через моего отца с хозяином повозки и попал четко в бандитов! Троицу ударом огромной силы сбило с ног и охватило магическим пламенем. Вот это мощь!"
        "Разбойники" "ААААААА!"
        "Разбойники" "ЧТО ЗА?!!"
        "Разбойники" "НЕЕЕЕЕЕЕТ!"
        hide susan with dissolve
        show mage at left with move
        "Через несколько секунд огонь погас, обнажив за дымкой обезображенные ожогами от пламени тела с переломанными костями. Мощнейший удар оказался смертельным для всей троицы."
        show father at right with dissolve
        father "'Хм. Чертовски знакомая магия.' - сказал отец и повернулся к магу."
        elmir "'Привет, Эдвард, я вижу, ты еще в форме, хаха.'- сказал низенький старенький человек."
        father "'Черт, Эльмир, а я думал, что тебя хватит только на магические фонарики.'- отец вложил меч в ножны, и с распростертыми обьятьями направился к своему собеседнику. Разглядеть мне его не удавалось, мешала огромная спина моего папы."
        elmir "'Хехе, ну привет, старина, давненько я так не гремел своими дряхлыми косточками.'"
        father "Да и чужими, видимо тоже."
        elmir "'Верно подмечено.'-маг снова тихонько захихикал."
        "Я подошла к ним и наконец смогла посмотреть на этого Эльмира. Это был худощавый человек, низкого роста, с лысиной на голове и подтянутым старческим лицом. Под серым мешковатым плащем был зеленоватый камзол, на груди ожерелье с большим драгоценным синим камнем, а  в его ухе виднелась серьга из серебра." 
        "А голос у него был высокий, почти женский, но с ноткой мужской рассудительности и решимости, чуть искаженной старческим беззаботным оттенком. Никогда бы не подумала, что этот старец- сослуживец моего отца и сильный маг. Может, этим он и обезоруживает врагов?"
        "Наконец я подошла к торговцу, стоящему рядом. Его немного трясло после сражения, но держался он уверенно."
        hide father with dissolve
        hide mage with dissolve
        show susan at left with dissolve
        # Пример диалога с исчезающими вариантами после их прохождения
        $ que = {1: True, 2: True}
        while que[1] or que[2]:
            menu:
                "С вами все хорошо?" if que[1]:
                    $ que[1] = False
                    susan "'С вами все хорошо?'- я обратилась к торговцу, который смотрел на встречу старых друзей и без брезгливых эмоций вытирал свой топор от крови."
                    "Торговец" "'Да, спасибо вам большое за помощь. Даже не знаю, чтобы случилось, если бы вы с господином не проезжали за нами.'- он низко поклонился."
                "Как ты понял, кто мой отец?" if que[2]:
                    $ que[2] = False
                    susan "'А как ты понял, кто мой отец?' - поинтересовалась я. Ведь мы были на охоте. На нас ни богатых одеяний, ни украшений, только разве что дорогое оружие, хотя и это не показатель..."
                    "Торговец" "'Госпожа, так драться в этих краях может только знаменитый Эдвард Глостер.'"
                    "Ах вот оно что. Ну конечно."
        "Я убрала оружие и максимально элегантно направилась к своему отцу, который беседовал со своим другом."
        show father at right with dissolve
        susan "Господа, нам следует разобраться с телами, здесь все еще небезопасно оставаться, давайте убираться отсюда."
        elmir "'Черт, она права.'- прокряхтел Эльмир."
        father "'Хорошо. Дружище, займись телами на дороге. Сьюзан, собери все оружие в телегу, а ты,'- отец кивнул в сторону торговца,-'помоги мне с телами у телеги и в лесу.'"
        "Торговец" "'Да, господин.'"
        hide father with dissolve
        hide susan with dissolve
        "Спустя 5 минут все тела были в телеге, а оружие было завернуто в плаще одного покойника и лежало сверху. Хоть обезображенные огнем и клинками тела выглядели отвратительно, радость от победы перекрывала все отвращение к смерти и трупам." 
        "Мы с отцом вскочили на коней, а торговец с Эльмиром сели в телегу, и мы все вместе с улыбками на лице с радостью победы двинулись в сторону замка."
    else:
        # Поражение в первом сражении
        "Твою мать! Я опять вжалась в щит, чтобы заблокировать удар. Эта туша с глиными зубами и огромным ножом наперевес вкладывала в удары такую силу, что я просто не успевала опустить щит и открыться для атаки. Он будто и не заметил всех тех ударов мой булавы, которые кое-как достали его."
        "Разбойник" "'Ну же! Давай, блять! ХАХАХАХ'"
        "Так, Сьюзан, без паники! Давай, как на тренировках: Защита с шагом назад,..., так, теперь... "
        show susan with vpunch
        "'Ай!'- при очередном отступлении я налетела на камень и упала на землю, щит отлетел в сторону. На рефлексе я подняла булаву для защиты, пытаясь встать на ноги и хоть что-то сделать... Булава вылетела из моей руки, не выдержав мощный удар сверху. Разбойник оскалился и уже занес оружие для решающего удара..."
        hide susan with dissolve
        "Разбойник" "'Я еще никогда не убивал таких красоток! Ну..Ээй, что за..'"
        "Внезапно у него за спиной появился мой отец. Через секунду мой противник с тихим стоном упал, пронзенный точно в сердце мечом моего отца."
        father "'Ты не ранена?'"
        susan "'Нет, я ...я в порядке'-испуганно и тяжело дыша пролепетала я."
        "Отец вытащил два метательных ножа из моего пояса и ринулся к дороге, где сражались торговец и маг, по пути сделав два молнеиносных движения."
        "Второй лучник не успел даже повернуть голову, как схватился на шею, пронзенную метательным ножом, а затем, ломая под собой ветки кустарника, рухнул на землю, когда второй нож почти по рукоять вошел ему в грудь, пробив легкий плащ, слегка измазанный грязью в перемешку с ветками и листьями для маскировки."
        "Взяв оружие, тяжело дыша, я подошла к повозке и прислонилась к ней, глядя на сражение чуть поодаль. Дела были плохи. Маг отпрыгнул от одного головореза, так и не успев прочитать заклинание. Тогда разбойник попытался ударить торговца."
        "Неуклюже увернувшись от удара копья, торговец ударил одного нападающего топором в лицо, но не смог уклониться от удара другого разбойника. Он выронил топор и упал на колени."
        "Торговец" "'Ааааа!'- на его руке была огромная рвано-резанная рана, откуда сразу ливанул поток алой крови."
        "Разбойник без лишних слов занес оружие для добивания раненого защитника повозки, но лишенный головы от меча моего отца, рухнул на дорогу, подняв тучу дорожной пыли. В этот момент те трое, что останавливали лошадь, ринулись к телеге, намереваясь прикончить раненого торговца, но маг вдруг замер на месте и вытянул руки в сторону нападавших." 
        "У его ладоней воздух исказился и три острые бледно-голубые, едва различимые магические стрелы со свистом полетели в разбойников."
        "Разбойники""'ЧТО ЗА?!!'"
        "Разбойники""'ААААА!'"
        "Разбойники""'Черт!'"
        "У одного из разбойников магическая стрела пронзила грудь, одному попала чуть ниже и левее- в живот, сильно откинув его, а кто бежал самый последний все же успел принять на щит магическую атаку. Он выронил его от мощного удара, но остался невредим."
        "Раненый разбойник""'Мммм...Кхх...Не надо! НЕТ!'"
        "Маг сразу выпустил еще один снаряд, которым попал четко в сердце стонущему на земле нападавшему. Выживший разбойник уже успел подойти к магу и приготовился атаковать, но к нему с необычайной прытью для своих лет приблизился отец, и головорез упал на землю с пробитым насквозь черепом."
        "Удивительно, но мой отец вместе с магом будто уже сражались вместе. Позиции, удары, магическая атака, все было похоже идеально отработанную боевую комбинацию на тренировке. Но никто не смотрел на своего партнера, не ждал его действий." 
        "Выглядело это так, словно у них был единый разум. Даже после тяжелой битвы, глядя на стонущего торговца, лужи крови и обезображенные трупы, я нашла время и силы для восхищения этой быстрой смертоносной битвой."
        "Теперь, когда звон оружия, боевые кличи нападавших и предсмертные крики стихли, лесную тишину и беспокойное дыхание лошадей разрывали крики раненного торговца, которые понемногу слабели и становились тише."
        "Оставшиеся в строю защитники подбежали к раненому, а я прошла чуть вперед, чтобы рассмотреть его получше. Дела его были плохи. Хоть он пытался закрыть рану рукой, через пальцы непрерывным потоком лилась алая кровь, которой было так много, что кровь окрасила землю в черный, отдающий матовым угольным блеском цвет."
        "Прислонившись к повозке, торговец очень сильно побледнел, был покрыт крупными каплями холодного пота, часто дышал и будто ничего не различал перед собой: его глаза словно смотрели в пустоту." 
        "Закусив губу, чтобы хоть как-то справиться с болью, он едва не оторвал ее, кровь стекала по его подбородку и крупными каплями падала на его коричневатую одежду из грубой ткани. Но это был ничтожный объем, по сравнению с рваной раной на руке. Даже если удастся остановить кровь, шансов выжить у него мало."
        "Мой отец уже успел вложить меч в ножны и подбежать к торговцу. Быстро осмотрев его, он сразу обратился к магу."
        father "'Эльмир, помнишь, как ты спас Моргана? Сможешь повторить?'"
        "Эльмир? Услышав что-то знакомое, поток беспокойных судорожных мыслей о том, как можно помочь умирающему, иссяк. Эльмир? Ну конечно, тот самый гениальный маг, с которым мой отец вместе служил. Никогда бы не подумала, что этот старик может быть мастером магии. Может, этим образом он обезоруживает врагов?"
        elmir "'Хе-хе, обижаешь, старина.'- Эльмир захихикал и довольно бодро подсел к раненому торговцу. "
        "Он легким жестом убрал окровавленные пальцы торговца с раны, и вытянул свою чуть согнутую ладонь в сторону раны. Вытекающими движениями магическая материя бледно-синеватого цвета обоволокла руку и образовала плотный магический барьер. Кровь остановилась. Другой рукой маг проверял пульс на сонной артерии торговца."
        "В это время мой отец залез в телегу и, вспоров кинжалом какую-то грубую ткань в виде длинной полоски, спрыгнул к раненому и стал очень плотно пережимать руку выше раны. Подобрав в качестве рычага палку, он очень быстро стал затягивать повязку. Зафиксировав ткань, он коротко отчитался магу."
        father "'Готово. Бери его снизу.'"
        elmir "'Староват я стал для таких делишек, хихи.'- проворчал Эльмир, но очень ловко подобрал торговца за ноги и помог моему отцу занести раненого в повозку. Он остался в повозке и вновь выставил руки вперед и сконцентрировался. Мой папа схватил за поводья запряженных в повозку лошадей, и быстро обратился ко мне."
        father "'Сюьзан, быстро на лошадь, и не забудь взять мою. Мы будем ехать быстро, но обязательно держись рядом с нами, ты поняла?' Я быстро кивнула в ответ и побежала за лошадьми, мельком поглядывая за Эльмиром, который сел рядом с торговцем."
        "Его ладони были вытянуты над телом раненого, но он не колдовал, а медленно и ритмично вращал ими, словно пытаясь нащупать что-то в воздухе."
        "Через полминуты у его рук воздух исказился, и из одной их его ладоней будто потек небольшой бледно-фиолетовые магический поток, который устремился в голову пострадавшему. Вторую ладонь Эльмир положил куда-то в районе живота торговца."
        "Магия еле заметным потоком устремилась в лоб и немного обволокла всю голову торговца. Эльмир был сосредоточен, и поддерживал этот поток: магическая струя немного переливалась. Торговцу словно полегчало- он энергично вдохнул воздух, его глаза задвигались, но дела его оставались плохи."
        "Кожа была бледная, дыхание прерывистое и быстрое, а кровь из раны хоть не лилась бурным потоков, но медленно сочилась, лишая организм пострадавшего драгоценных каплей."
        elmir "'Погнали, красавчик, меня надолго не хватит.'- кинул в сторону моего отца маг. Папа быстро глянул на меня и пустил коней во весь опор. Я держалась рядом. А Эльмир даже в сильной тряске как-то мог поддерживать магический поток." 
        "Хоть мы гнали коней во весь опор, мой разум потихоньку прояснялся. Моменты, как надо мной занесли нож, обезображенные трупы, страшные раны и убийства мелькали передо мной, как в жутком кошмаре. На мнгновение мне захотелось проснуться, но страшная и беспокойная реальность не отпускала."
        "Я готова была спрыгнуть с лошадей и с криками в слезах побежать куда-угодно, неважно куда, но я посмотрела на моего отца. Его сосредоточенный вид помогал мне держаться. Он периодически подлядывал на меня, что придавало мне уверенности и поддерживало меня. Отметая все мысли, я плотнее сжала поводья и устремила свой взгляд вперед, где вдалеке виднелся наш замок."
        "Бешеные скачки продолжались, и мы все приближались к замку. Передо мной замелькали пастбища, которые сменились на поля с домами рабов. Когда мы въезжали в деревню рабов, скорость пришлось сбавить из-за сложных поворотов, хоть дорога и была широкой." 
        "Все рабы с изумлением смотрели, как их господа, залитые чужой кровью, с раненым в телеге с бешеной скоростью рвались к замку. Я знала, что и в деревне рабов есть лекарь, но, судя по всему, тут может помочь только целитель замка."
        "Лошадь, впряженная в телеге очень громко и устало дышала, словно пытаясь выплюнуть весь воздух. Пот с нее лился ручьем, а запах будто уже пропитал все вокруг. Телега жутко скрипела и, казалось, что в любой момент готова была рассыпаться в щепки."
        father "'Давай, терпи, родимая, немного осталось.!'- почти крича обращался к лошади мой отец. Несмотря на все его переживание обо мне и ситуации в лесу, я чувствовала в его голосе и в моментах, когда он быстро переводил взгляд от меня на дорогу настоящий азарт. Как он способен на это в такие моменты?"
        "Очередной крутой поворот заставил меня оторваться от наблюдений и размышлений. Теперь я чувствовала лишь свои натянутые, как струны, мышцы вместе с телом моей лошади. Я настолько сосредоточилась, что на глубокие размышления времени не было-сейчас мой разум анализировал лишь момент. Держа дистанцию, я четко двигалась со своими попутчиками."
        "Стражник" "'ЭЙ! СТОЯТЬ!'-крикнул издали один из стражников, который патрулировал дорогу у замка. Он развернул лощадь, чтобы перекрыть дорогу, но, узнав моего отца, сразу помчался в сторону замка, опережая нас лишь на несколько десятков метров."
        "Наконец мы заехали на главный холм. Оставалось немного. Вот уже виднеется длинный каменный мост, а за ним главные ворота."
        "Стражник" "'ДОРОГУ! РАЗОЙДИТЕСЬ!'- слышалось издалека, как кричал уже успевший забежать наш недавний попутчик. За воротами слышались ответные фразы, звуки бега и возмущенные звуки лошадей."
        father "'Сьюзан, оставь лошадей страже, мы к Гипу.'- на бегу крикнул мне отец, продолжая смотреть на дорогу, чтобы совершить сложный поворот уже в обширном дворе замка. Быстро кивнув ему, я направила лощадей к конюшне."
        "Остановив лошадей, я быстро спрыгнула с лошадей на каменную кладку двора. Мои итак измученные мышцы заныли от резкого напряжения. Стиснув зубы и отмахиваясь от всей прислуги, что спращивала о моем состоянии, я мельком крикнула смотрителю стоил, чтобы он забрал лошадей."
        "'...немедленно направить три отряда на торговую дорогу. Убрать тела и оружие, прочесать лес. И немедленно выяснить, как получилось, что банда разбойников основалась на наших землях!'-было слышно, как отец раздавал приказы командиру стражи. После этого он быстро побежал за Эльмиром, чтобы помочь ему."
        "Собрав всю волю в кулак для мысленного и физического рывка, я побежала к двери во внутреннем дворе замка, где, оставив за собой небольшой пыльный след, уже стояла телега. Я мельком заметила, как ассистент лекаря помог занести внутрь помещения раненого торговца, скрывшись затем за тяжелой дверью."
        "От гулкого удара закрывающейся тяжелой обитой железом дверью я ощутила еле уловимый толчок под ногами. Наконец, тяжело дыша, приложив немалые усилия, я потянула увесистую дверь на себя и ввалилась внутрь."
        "'Ну кого там, блять, еще несет?'- воскликнул худощавый жилистый человек лет 40 с неприятным лицом, который помогал уложить торговца на большой стол в центре просторной комнаты. Поймав на себе его взгляд я сразу вздрогнула. Темные глаза с грубого лица яростно впились в меня, будто кинжал."
        "Однако увидев меня, человек быстро мотнул головой, словно услышал полную чушь, и устремил свое внимание на раненого. Я сразу же узнала его. Неприятного человека звали Гип. И сейчас он главный лекарь во всех владениях Глостеров."
        "По комнате бегал его ассиcтент, поворачивая многочисленные небольшие зеркала, которые висели на стенах и даже потолке, пытаясь перенаправить и сфокусировать яркий солнечный свет с небольшого окна на рану торговца. Вдруг он вздрогнул от громкого и чертовски недовольного возгласа в его сторону."
        gip "'Твою мать, Арчи, ну где там свет?'- лекарь уже пододвинул к большому столу еще один, небольшой столик, по высоте на уровне его живота, где он уже успел разложить на небольшом деревнном подносе разные приспособления для предстоящей операции."
        "Перед ним были разложены разные небольшие острые бронзовые инструменты, странные нитки, иголки разных размеров, чистые повязки, высушенные морские губки, мотки веревки, несколько баночек( судя по едкому запаху, в одной из нихз был спирт). Даже маленькая деревянная дубинка нашла свое место перед врачевателем."
        "Арчи" "'Готово.'- ассистент коротко отчитался и быстро встал по левую руку от Гипа."
        "Торговец" "'НЕТ! Я не умру! Я...я, не..хочу, у меня ... семья...ааа...'- вдруг торговец стал бредить и дергаться на столе. Гип быстро обратился к моего отцу и Эльмиру."
        gip "'По голове его били?'-быстро спросил Гип, сжав в руке небольшую деревянную дубинку. Другой рукой он сдерживал торговца за голову."
        elmir "'Мы его точно не били, хихи. Ой, простите.'- Эльмир словно совсем не переживал о жизни торговца, хотя и внимательно слушал лекаря, готовый в случае чего помочь."
        father "'Он сильно ударился головой, когда падал.'- спокойно сказал мой отец, быстро осматривая комнату и всех, кто в ней находился. Чуть дольше он задержал взгляд на мне. Несмотря на непростую ситуацию, я почувствовала небольшое облегчение и немного успокоилась."
        "Гип быстро отложил дубинку, повернул голову торговца в свою сторону, а затем вдруг коротко, но очень хлестко ударил раненого в щеке, а когда его голова дернулась в сторону пощечины, быстро схватил ее руками, повернул к себе и, практически в плотную наклонившись над ней, крикнул торговцу."
        gip "'Ты точно умрешь, если будешь лежать. БЫСТРО ВСТАТЬ! ПОДЪЕМ!'"
        "Глаза торговца в испуге забегали. Из последних сил он схватился здоровой рукой за край стола и резко попытался встать. Как только он поднялся, его глаза закатились, тело обмякло, и он потерял сознание. Быстро подхватив тело, Гип направил свет на рваную рану на руке."
        gip "'Арчи, готовь коноплю и дыхательную трубку.'-не переставая осматривать раненую руку обратился к своему ассистенту лекарь."
        "Худой парнишка Арчи сделал два быстрых шага с полкам с разными приборами и склянками и быстро достал большую широкую деревянную трубку странной изогнутой формы с небольшими дырочками с одной стороны и небольшое железное блюдце с двойным дном. Также он взял широкую деревянную доску и небольшую стеклянной с высушеной травой."
        "Он перенес все к столу и стал устанавливать это сооружение. Сперва на грудь пациента он положил деревянный поднос и железное блюдце. Рядом он положил трубку, направив круглое отверстие вниз. Другая сторона была плотно прижата ко рту и носу раненого. Из трубки сразу послышалось глухое эхо прерывистого дыхания."
        "Далее Арчи прогрел блюдо магией, а потом равномерно рассыпал на горячее железо сушеную траву, чуть подпалил огнем и ее, а когда она начала тлеть, то сбрызнул траву водой, а затем плотно закрыл блюдо круглой частью трубки. Получилось, что раненый дышал парами конопли- эффективного обезболивающего."
        "В то время, пока Арчи заботился, чтобы торговец внезапно не проснулся, Гип снял повязку, но не разматывая плотный жгут, наложенный моим отцом выше раны, наложил еще один жгут ниже раны. Затем стал высушивать рану с помощью губок, выжимая кровь в специальные кровостоки в столе, которые вели в ведро, закрепленное под столом."
        gip "'Прижимай.'- коротко обратился Гип к ассистенту, откладывая инструменты и готовя иглу с ниткой. Арчи раздвинул края раны, где теперь четко была видна белоснежная кость с небольшим углублением от топора, а также ярко-красная крупная артерия, которую разорвало надвое. Зафиксировав края раны, Арчи пинцетами прижал края артерии."
        gip "'Фиксируй.'- приказал Гип Арчи, быстро и ловко зашив артерию, а затем и края раны на руке. Асситент сделал плотные, но не давящие широкие повязки по обеим сторонам от раны, а затем плотно стянул их третьим лоскутом чистой ткани. В это же время подошел Гип и стал обматывать рану тканью, вымоченную в отваре коры дуба."
        "Когда рана была закрыта повязками, лекарь осмотрел проделанную работу, затем проверил пульс, дыхание больного, ощупал его кожу и заглянул в его глаза. После этого Гип немного отошел от стола. Несмотря на то, что в его внешнем виде почти ничего не поменялось, было заметно, что он немного расслабился."
        gip "'Эдвард, когда ты наложил жгут?'- все еще сохраняя неприятное лицо спросил Гип чуть хриповатым низким спокойным голосом."
        father "'Не больше часа назад.'-на протяжении всей операции он сохранял невозмутимо спокойное лицо. И лишь краем глаза можно было разглядеть еле уловимое выражение лица, которое даже я, прожившая рядом с отцом 19 лет, могу заметить лишь долго и усердно всматриваясь в лицо своего родителя."
        "Беспокойство. Еле заметное переживание было заметно на лице Эдварда Глостера-человека, прошедшего через такое количество битв и увидевшего такое количество смертей. В тяжелые моменты, когда он убеждался, что с его близкими все хорошо, мой отец действительно переживал за всех своих людей. Пусть и всячески старался это скрыть."
        gip "'Арчи, сейчас сними нижний жгут, через минут 5-верхний. Через час убирай коноплю. А дальше ты знаешь, что делать.'"
        "Арчи" "'Я все понял.'-он коротко кивнул и начал убирать место операции."
        gip "'Посмотрим еще, как ты понял.'-проворчал под нос себе Гип, а затем, пройдя к внутренней двери, ведущей в коридоры замка, обратился к Эльмиру-'Ты то какого хрена тут делаешь?'"
        elmir "'Да вот решил навестить старых друзей, хехе. Неужели ты не рад меня видеть, хихи?'-маг выглядел бодро, несмотря на прошедшую битву и на оказанную магическую поддержку раненому. Как это ему удалось так долго поддерживать магический поток? Что это была за магия? Отец прав, он очень многому сможет меня научить."
        gip "'А ты еще не растерял свою магическую хватку. Ты чертовски помог своему попутчику.'- ворча произнес лекарь в дверях. Затем, на миг дернув уголками губ в виде улыбки, вновь обратился к Эльмиру своим обычным ворчащим голосом-'Ладно, пошли выпьем, старина.'"
        "Эльмир, вновь расцветая своей добродушной улыбкой, весело потопал за Гипом. Мой отец тоже было хотел пойти за ним, но маг легко придержал его, указав на меня рукой."
        elmir "'Эдвард, поговори с дочерью. Не беспокойся, мы постараемся не выпить весь твой погреб, с нами ведь нет толстяка Маппы, хахха.'"
        father "'Верно, ты прав.'-наконец папа подошел ко мне, а затем вновь обратился к уходящему Эльмиру-'Дружище, чертовски рад тебя видеть!'"
        "Маг развернулся и быстро поклонился, вкладывая в этот светский дружеский поклон всю свою добродушную старческую харизму. После того, как дверь за старыми друзьями Эдварда Глостера закрылась, мой папа приобнял меня и, мы направились во двор замка."
        father "'Пойдем, Сьюзан, нам пора отдохнуть.'-невероятно успокаивающим голосом произнес мой отец."
        "Наконец-то я выдохнула спокойно. Хватит с меня крови, смертей и битв на сегодня. Прежде чем расслабиться, перед моими глазами последние 2 часа пронеслись, как страшный сон. Но теперь, крепко прижавшись к большой груди моего защитника, я знала, что все будет хорошо. Вместе с моим папой мы вышли во двор замка."

        #1111111111 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 2222222222 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 3333333333 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789 4444444444 0123456789 0123456789 0123456789 0123456789 0123456789 0123456789
    
        
        

    jump chapter_1


label first_fight:
    menu:
        "Итог сражения"  
        "Победа":
            $ first_fight_flag = True
        "Поражение":
            $ first_fight_flag = False
    jump first_fight_end
