label prologue:
    show screen resource_ui
    scene forest with dissolve
    father "Сьюзан, он слева!"
    show susan portrait at left with dissolve
    "Привычно сжав ногами теплую спину коня, мыщцы котрого натянулись от скорости и азарта погони, я вскинула небольшой охотничий арбалет на изготовку и стала ловить момент для выстрела. Дерево. Еще одно. Еще ближе. Опять дерево. Бревно."
    susan "АГА! Попался!"
    show deer at right with dissolve
    "Арбалетный болт со свистом пролетел между деревьев и утонул в зеленом море летней лесной травы, а олень, будто смеясь, вильнул мимо меня и помчался вперед нас."
    hide deer with dissolve
    susan "'Черт!' - вырвалось у меня и я, обвив вокруг руки ремень узды коня, принялась перезаряжать арбалет."
    hide susan with dissolve
    show father at right with dissolve
    father "Хаха, что ж, настала моя очередь! Вперед!"
    "Весело прокричал второй всадник, накладывая стрелу на тетиву огромного лука и мчась вперед по лесной тропе. И вот, спустя секунд 10 раздалось победное"
    father "Есть!"
    hide father with dissolve
    "И олень с пронзительным визгом упал и покатился в траву."
    show susan with dissolve
    susan "Ну пап, опять ты выиграл!"
    hide susan with dissolve
    "Я взглянула на своего отца, который уже закинул лук назад и уверенно держался в седле, провожая взглядом поверженного метким выстрелом оленя. Он тоже посмотрел на меня, но я не успела ничего прочитать в его взгляде."
    show father with dissolve
    father "Сьюзан, берегись!"
    hide father with dissolve
    "Я посмотрела на дорогу и в последний момент успела пригнуться от нависшей ветки, однако потеряла равновесие и на большой скорости начала падать вниз... У земли меня встретила не боль и агония от переломов, а мягкий магический поток, замедливший меня, после чего я прислонилась к ближайшему дереву. Через секунду мой отец спрыгнул с коня и присел рядом со мной."
    show father with dissolve
    father "Ты в порядке?"
    hide father with dissolve
    show susan with dissolve
    susan "'Жить буду' - пролепетала я, переводя дыхание."
    hide susan with dissolve
    show father with dissolve
    father "Ну хорошо."
    "Папа улыбнулся своей заботливой улыбкой. Затем он пошел за поверженным оленем. Вот он, во плоти, в сияющих лучах солнца- подтянутый, красивый человек с серебристыми волосами и едва заметным шрамом у глаза, с невероятно уверенными и в тоже время заботливыми глазами, в зрелом возрасте, который, однако готовый посостязаться в ловкости и силе с любым человеком - Эдвард Глостер"
    hide father with dissolve
    "потомственный дворянин, военный, успешный торговец, крупнейший землевладелец с безупречной репутацией человека, умеющего вести дела. Странно, что сейчас я его описываю именно так, ведь когда мы вместе с папой уходим охотиться, то забываем все титулы, обязанности, ценность всех украшений и оружия, что носим с собой, и начинаем состязание в меткости стрельбы и умении держаться в седле."
    "Охватываемый чувством азарта, ты начинаешь ловить каждый момент, каждое шевеление листвы, каждый шаг, каждый удар биения сердца, словно с твоим напарником оно бьется в едином ритме. В такие моменты рядом со мной не Эдвард Глостер, а родной и любимый папа, мой наставник и друг, который всегда находил для меня время за все те 19 лет, когда он рядом со мной."
    "А еще он чертовски хороший охотник, и хоть, я рада, что мы наконец догнали этого проворного оленя, мне немного обидно, что я так и не попала в него. Эх, как же это раслабляет от нашей дворянской рутины. Я подозвала своего коня и стала отряхивать со своей одежды куски земли и листву. Да, не подобает аристократке Сьюзан Глостер так выглядеть. К этому моменту отец с тушей оленя подошел ко мне."
    show father with dissolve
    father "Ну что, меткий стрелок, нам пора возвращаться в замок."
    hide father with dissolve
    "Я кивнула, и мы, оседлав коней, направились к нашему замку, вместе проходя родные кроны деревьев, цветы, ягоды, цветы и вдыхая каждый приветливый лесной мимолетный и радостный летний запах, вкушая все моменты нашей прекрасной жизни. Мы шли по знакомой тропе. Слышался спокойный стук копыт и тихое пение птиц на деревьях."
    show susan at left with dissolve
    susan "Кстати, ты проиграл. Хихи. Мы же договорились не использовать магию на охоте."
    show father at right with dissolve
    father "А еще у нас завтра встреча с бароном Маппой, где ты должна быть."
    susan "Весьма эгоистичная причина."
    father "'А теперь вспомни, с чего ты начала разговор.' - отец улыбнулся."
    susan "Слушай, а как работает магия?"
    "В быту я видела мало магии, учиться ей я не хотела (но понимала, что когда-нибудь это придется сделать). Магией колдовали боевые заклинания, поднимали магические щиты на полях боя, разжигали огонь, охлаждали и нагревали воздух и делали много чего еще, но как она работала, я толком не знаю."
    father "Очень просто. Магия- это преобразование твоей энергии. А во что именно ее превращать- в огненный шар, барьер или мягкий поток решать тебе."
    susan "А исцелять ей можно?"
    father "'В теории это возможно. Но на практике этого никому не удавалось. Видишь ли, всякие огненные шары, ледяные стены, магические барьеры состоят из одного вида материи, куда ты и направляешь свою энергию, а живая плоть невероятно сложная в создании...' - внезапно папа притих - 'Конечно, я пробовал, но безуспешно.' Его мимолетная скорбь исчезла и он снова вернулся в прежнее расположение духа."
    father "Честно говоря, Сьюзен, я мало чего знаю о магии. Возможно, тебе нужно поговорить с моим хорошим знакомым магом Эльмиром. Он научился колдовать еще в раннем возрасте, может, он начнет твое обучение и ответит на твои вопросы."
    susan "'Ты правда думаешь, что мне нужно учиться магии? Это же нереально истощает и выматывает!'- я по-детски обиделась и сморщила нос."
    father "Конечно, маленькой Сьюзи не нужно корпеть над магическими писменами, а вот аристократке Сьюзен Глостер необходима базовая магическая подготовка, чтобы защитить себя. Да и на охоте это выручает, как видишь."
    susan "Я и так смогу за себя постоять. У меня есть для этого все необходимые навыки."
    "Я коснулась рукояти небольшой булавы и глянула на перевязь с метательными ножами."
    father "Я не всегда буду рядом. Конечно, тебе, как девушке из знатного рода, не придется сражаться в войнах, но у нас много врагов. Мы должны защитить свою семью и друзей. Так что начни изучать магию, лишним не будет."
    susan "Хорошо, папа. Я займусь этим в ближайшее время."
    father "'Ну и умница.' - он вновь наградил меня своей безупречной улыбкой - 'Скоро наши владения, начинай вести себя прилично, хахаха.'"
    susan "Сударь, я откажусь от комментариев."
    "Лес становился все реже, заросли сменялись опушками, а многолетние деревья- молоденькими стволами."
    father "Ну вот мы и дома."
    hide father with dissolve
    hide susan with dissolve
    scene fields with dissolve
    "Мы вышли из леса на небольшой холм, откуда были видны наши родные земли. Сначала зеленой полосой распологались поля, за ними чернели плодородные почвы, где росли овощи и травы, а потом их сменяли сады с аккуратно ухоженными дорожками. Левее полей сверкающей змеей текла река, у ее берегов виднелись мельницы и скромные дома рабов. А в центре был наш замок. Небольшой, но древний."
    "Могучие стены с рвом, обитые металлом ворота, красная черепица впитывала солнечный свет, а на самой высокой башне гордо развивался флаг Глостеров. Большая пыльная торговая дорога шла от замка вдаль к городу, по который шли обозы с товарами. А справа от замка вдалеке виднелись величественные горы. Передо мной раскинулись все владения моего славного и великого рода."
    "И я буду хранить эти земли во имя Глостеров."
    "Насладившись этим прекрасными видом, мы с отцом направились к замку."
    "Напрямую дорогу от лесного холма к замку не было. Так что приходится обезжать все поля и сады левее - там, где стоят водяные мельницы и домики рабов. Мы вышли на небольшую дорогу, полную слебов от копыт и колес телег, нагруженными зерном и мукой. Все, кто встречал нас, кланялся и уступал дорогу, отец же почтительно кивал в ответ."
    scene watermill with dissolve
    "Я тоже старалась так делать, но получалось у меня слишком уж резко, энергично и безэмоционально, сказывается недостаток опыта. В этих местах мельниц было всего две, но зато какие это были мельницы. Первая - огромный каменный водяной монстр с гигантским водяным колесом размером с крепостную стену, которое будто укращало течение могучей реки, а не повторяло ее ритм."
    "В стенах этой мельницы уже не одно поколение перемалывало зерно, а птицы уже привыкли за много лет гнездиться под крышей, а она стояла еще когда я не родилась. Эта постройка была чуть ли не самой старой в нашем округе, не считая, разве что, замка."
    "В двух километрах ниже по течению реки виднелась вторая мельница. Она была чуть поменьше, из деревянного сруба и будто утопала в самой реке. Ее внешний вид понятен, ведь ее колесо находилось снизу постройки и вращалось в горизонтальной плоскости (да, учения математики от учителя Персифаля не прошли даром). Выглядела она скромно, да и своей эффективностью, насколько я знаю, не радовала."
    "Но один умник заплатил моему отцу очень кругленькую сумму в очень хороший момент, за что он разрешил построить эту мельницу. Вот она и работает, принося небольшой процент - этому грамотею, а еще больший - моему отцу. Пусть эта мельница и была молодой и из дерева, но она имела свой небольшой стиль, а безобидные резные фигуры из дерева то и дело встречались в ее корпусе."
    "Выглядела она мило, но малоэффективно. Минуя невзрачные, но чистые, домики рабов и мельницы, мы вышли на небольшой торговый перекресток. Если пойти левее, то дорога пересекалась с большой торговой дорогой, ведущей в город, а если свернуть правее, то дорога становилась уже и вела к нашему замку."
    "По обе стороны от дороги к нашему замку располагался молодой лес, а при приближении к замку, он сменялся на яблочный сад. Несмотря на то, что главная торговая площадь находится в городе, в сторону нашего замка тоже напрявляются торговые обозы. Некоторые товары необходимы для поддержания стабильной работы структуры замка и его окружения, а с некоторыми торговцами отец ведет дела лично."
    scene forest with dissolve
    "Мы свернули направо и направились к замку. Впереди нас мирно ехала торговая телега, накрытая цветной тканью. Впереди сидели двое. Один держал за поводья лошадь, скорее всего, торговец, а рядом сидел человек в сером мешковатом одеянии, может, второй торговец или просто попутчик. Проехав еще немного, отец, вдруг, стал крутить головой по сторонам и вглядываться в заросли."
    show father with dissolve
    father "'Что-то не так...'- хмуро сказал он, глядя вперед повозки."
    hide father with dissolve
    "Внезапно из кустов выскочило семеро вооруженных людей. Трое из них стали хватать за поводья лошадь, останавливая повозку, двое с копьями полезли к телеге, а еще двое остались в зарослях и вскинули легкие луки."
    show father with dissolve
    father "'Засада! Держись позади меня, Сьюзан!'- крикнул отец, обнажая свой меч, спрыгивая с коня и напрявляясь прямо на врагов."
    hide father with dissolve
    "Я соскочила с коня, сняла с седла небольшой деревянный щит, достала булаву и побежала за отцом."
    "Торговец" "'Сучьи разбойники! Уходим за телегу!' - донеслось из телеги."
    "Разбойники" "'Хехехе, попробуй от нас убежать, паскуда!' - хрипло выкрикнул кто-то из нападавших."
    "Торговец с его спутником в капюшоне выскочили из телеги. Первый достал из под ткани топор, а другой человек остался позади и стал читать заклинание. Так он маг?"
    menu:
        "Вдруг я услышала еле уловимый свист слева, который приближался ко мне. Я повернула голову и тут до меня дошло..."
        "Уклонилась":
            "Отработанным на тренировках движением я вскинула щит и словила стрелу. Ну попробуйте, мрази!"
            show susan with vpunch
            susan "'Я за лучниками!'- крикнула я отцу и зигзагами, уворачиваясь от стрел, побежала к этим уродам в кусты, а они только и думали натягивать свои луки, да стрелять в меня."
            hide susan with dissolve
            "Когда я была уже совсем рядом, один из них откинул лук, достал большой уродливый нож и прыгнул навстречу мне."
            "Разбойник" "Ну давай, сейчас мы тебе подправим мордашку."
        "Не уклонилась":
            "АЙ! Стрела вонзилась мне в плечо, немного пробив кожанный наплечник. Плечо загорелось огнем."
            show susan with vpunch
            susan "'АААААА, МРАЗИ! Я за лучникам!'-крикнула я отцу. Ну держитесь, суки, я вам сейчас такое устрою. Я зверски кинулась на врагов, попутно уворачиваясь от стрел."
            hide susan with dissolve
            "Когда я была уже совсем рядом, один из них откинул лук, достал большой уродливый нож и прыгнул навстречу мне. Ну все, пора тебе раздробить пару-тройку костей."
    jump first_fight
    label first_fight_end:
    if first_fight_flag:
        # Победа в первом сражении
        "Наконец моя булава достигла цели, послышался хруст сломанных ребер, бандит согнулся, а я врезала ему по голове. Он скатился в канаву с пробитым черепом. Я глянула на второго лучника, уже натягивавшего тетиву лука и целящегося в меня. Я вскинула щит и готова была бросится на него, но тут к нему с необычайной для своих лет прытью приблизился отец."
        "Один взмах его меча, фонтан кровяных брызг и разбойник падает на землю с рассеченной грудью, так и не успев вскинуть оружие для защиты."
        show father at right with dissolve
        show susan at left with dissolve
        father "'Ты в норме?'-отец быстро глянул на меня."
        susan "Да!"
        hide father with dissolve
        "Отец коротко кивнул и ринулся к телеге, где сражались торговец и маг с остатками шайки."
        "Я оббежала телегу и увидела, как торговец неуклюжо отскочил от удара копья, а затем прыгнул сбоку и пробил топором спину бандиту. С криком он повалился на землю, подняв тучу пыли. Не мешкая, торговец пробил ему говолу обухом"
        show mage at right with dissolve
        "Те трое людей, что останавливали лощадь, кинулись с копьями и ножами на защитников торговой телеги, но тут маг быстро прочитал заклинание и огромный огненный шар сорвался с его рук, перелетел через моего отца с хозяином повозки и попал четко в бандитов! Троицу ударом огромной силы сбило с ног и охватило магическим пламенем. Вот это мощь!"
        "Разбойники" "ААААААА!"
        "Разбойники" "ЧТО ЗА?!!"
        "Разбойники" "НЕЕЕЕЕЕЕТ!"
        hide susan with dissolve
        show mage at left with move
        "Через несколько секунд огонь погас, обнажив за дымкой обезображенные ожогами от пламени тела с переломанными костями."
        show father at right with dissolve
        father "'Хм. Чертовски знакомая магия.' - сказал отец и повернулся к магу."
        elmir "'Привет, Эдвард, я вижу, ты еще в форме, хаха.'- сказал низенький стренький человек."
        father "'Черт, Эльмир, а я думал, что тебя хватит только на магические фонарики.'- отец вложил меч в ножны, и с распростертыми обьятьями направился к своему собеседнику. Разглядеть мне его не удавалось, мешала огромная спина моего папы."
        elmir "'Хехе, ну привет, старина, давненько я так не гремел своими дряхлыми косточками.'"
        father "Да и чужими, видимо тоже."
        elmir "'Верно подмечено.'-маг снова тихонько захихикал."
        "Я подошла к ним и наконец смогла посмотреть на этого Эльмира. Это был худощавый человек, низкого роста, с лысиной на голове и подтянутым старческим лицом. Под  серым мешковатым плащем было видно ожелелье с большим драгоценным синим камнем и зеленоватый камзол, а его ухе виднелась серьга из серебра. А голос у него был высокий, почти женский, но с ноткой мужской рассудительности и решимости, чуть искаженной старческим беззаботным оттенком"
        hide father with dissolve
        hide mage with dissolve
        show susan at left with dissolve
        # Пример диалога с исчезающими вариантами после их прохождения
        $ que = {1: True, 2: True}
        while que[1] or que[2]:
            menu:
                "С вами все хорошо?" if que[1]:
                    $ que[1] = False
                    susan "'С вами все хорошо?'- я обратилась к торговцу, который смотрел на встречу старых друзей и без брезгливых эмоций вытирал свой топор от крови."
                    "Торговец" "'Да, спасибо вам большое за помощь. Даже не знаю, чтобы случилось, если бы вы с господином не проезжали за нами.'- он низко поклонился."
                "Как ты понял, кто мой отец?" if que[2]:
                    $ que[2] = False
                    susan "'А как ты понял, кто мой отец?' - поинтересовалась я. Ведь мы были на охоте. На нас ни богатых одеяний, ни украшений, только разве что дорогое оружие, хотя и это не показатель..."
                    "Торговец" "'Госпожа, так драться в этих краях может только знаменитый Эдвард Глостер.'"
                    "Ах вот оно что. Ну конечно."
        "Я убрала оружие и максимально элегантно направилась к своему отцу, который беседовал со своим другом."
        show father at right with dissolve
        susan "Господа, нам следует разобраться с телами, здесь все еще небезопасно оставаться, давайте убираться отсюда."
        elmir "'Черт, она права.'- прокряхтел Эльмир."
        father "'Хорошо. Дружище, займись телами на дороге. Сьюзан, собери все оружие в телегу, а ты,'- отец кивнул в сторону торговца,-'помоги мне с телами у телеги и в лесу.'"
        "Торговец" "Да, господин."
        hide father with dissolve
        hide susan with dissolve
        "Спустя 5 минут все тела были в телеге, а оружие было завернуто в плаще одного покойника и лежало сверху. Хоть обезображенные огнем и клинками тела выглядели отвратительно, радость от победы перекрывала все отвращение к смерти и трупам. Мы с отцом вскочили на коней, а торговец с Эльмиром сели в телегу, и мы все вместе с улыбками на лице с радостью победы двинулись в сторону замка."
    else:
        # Поражение в первом сражении
        "Твою мать! Я опять вжалась в щит, чтобы заблокировать удар. Эта туша с глиными зубами с огромным ножом наперевес вкладывала в удары такую силу, что я просто не успевала опустить щит и открыться для атаки. Он будто и не заметил всех тех ударов мой булавы, которые кое-как достали его."
        "Разбойник" "'Ну же! Давай, блять! ХАХАХАХ'"
        "Так, Сьюзан, без паники! Давай, как на тренировках: Защита с шагом назад,..., так, теперь... "
        show susan with vpunch
        "'Ай!'- при очередном отступлении я налетела на камень и упала на землю, щит отлетел в сторону. На рефлексе я подняла булаву для защиты, пытаясь встать на ноги и хоть что-то сделать... Булава вылетела из моей руки, не выдержав мощный удар сверху. Разбойник ослалился и уже занес оружие для решающего удара..."
        hide susan with dissolve
        "Разбойник" "'Я еще никогда не убивал таких красоток! Ну..Ээй, что за..'"
        "Внезапно у него за спиной появился мой отец. Через секунду мой противник с тихим стоном упал, пронзенный точно в сердце мечом моего отца."
        father "Ты не ранена?"
        susan "'Нет, я ...я в порядке'-испуганно и тяжело дыша пролепетала я."
        "Отец вытащил два метательных ножа из моего пояса и ринулся к дороге, где сражались торговец и маг, по пути сделав молнеиносное движение."
        "Второй лучник не успел даже повернуть голову, как схватился на шею, пронзенную метательным ножом, а затем, ломая под собой ветки кустарника, рухнул на землю, когда второй нож почти по рукоять вошел ему в грудь, пробив легкий плащ."
        "Взяв оружие, тяжело дыша, я подошла к повозке и прислонилась к ней, глядя на сражение чуть поодаль. Дела были плохи. Маг отпрыгнул от одного головореза, так и не успев прочитать заклинание, тогда разбойник попытался ударить торговца."
        "Неуклюже увернувшись от удара копья, торговец ударил одного нападающего топором в лицо, но не смог уклониться от удара другого разбойника. Он выронил топор и упал на колени."
        "Торговец" "'Ааааа!'- на его руке была огромная рвано-резанная рана, откуда сразу ливанул поток алой крови."
        "Разбойник без лишних слов занес оружие для добивания раненного защитника повозки, но лишенный головы от меча моего отца, рухнул на дорогу, подняв тучу дорожной пыли. В этот момент те трое, что останавливали лошадь, ринулись к телеге, намереваясь прикончить раненого торговца, но маг вдруг замер на месте и вытянул руки в сторону нападавших." 
        "У его ладоней воздух исказился и три острые бледно-голубые, едва различимые магические стрелы со свистом полетели в разбойников."
        "Разбойники""'ЧТО ЗА?!!'"
        "Разбойники""'ААААА!'"
        "Разбойники""'Черт!'"
        "Одного разбойников магическая стрела пронзила его грудь, одному попала чуть ниже и левее- в живот, сильно откинув его, а кто бежал самый последний все же успел вскинуть щит и принять удар магического удара. Он выронил щит от мощного удара, но все же остался невредим."
        "Раненый разбойник""'Не надо! НЕТ!'"
        "Маг сразу выпустил еще один снаряд, которым попал четко в сердце стонущему на земле нападавшему. Выживший разбойник уже успел подойти к магу и приготовился атаковать, но к нему с необычайной прытью для своих лет приблтзился отец, и головорез упал на землю с пробитым назквозь черепом."

        
        

    jump chapter_1


label first_fight:
    menu:
        "Итог сражения"
        "Победа":
            $ first_fight_flag = True
        "Поражение":
            $ first_fight_flag = False
    jump first_fight_end
